[{
        "joke": "The 2nd fastest thing is poop. What is even faster?",
        "pun": "Water splashing back up."
}, {
        "joke": "Do you have a bathroom? No, it’s only for the employees.",
        "pun": "Well, I’d like to apply for a job."
}, {
        "joke": "One added negative, about being blind...",
        "pun": "You never know when you're done wiping."
}, {
        "joke": "If White Castle was a real castle…",
        "pun": "The moat would be made of diarrhea."
}, {
        "joke": "Have you heard of the constipated mathematician?",
        "pun": "He worked it out with a pencil."
}, {
        "joke": "What’s the true definition of bravery?",
        "pun": "Chancing a fart when you know you’ve had diarrhea."
}, {
        "joke": "Support Bacteria!",
        "pun": "They’re the only culture some people have."
}, {
        "joke": "What would you call a person who sends fart jokes by email all the time?",
        "pun": "A person who passed gas frequently."
}, {
        "joke": "What do you get if you eat beans and onions?",
        "pun": "Tear gas."
}, {
        "joke": "Why did the girl take toilet paper to the party?",
        "pun": "Because she was a party pooper!"
}, {
        "joke": "What's brown and sits on a piano bench?",
        "pun": "Beethoven's last movement."
}, {
        "joke": "What do you call a person that doesn't fart in public?",
        "pun": "A private tutor."
}, {
        "joke": "Why don't you fart in church?",
        "pun": "Because you have to sit in your pew."
}, {
        "joke": "Did you hear about the constipated accountant?",
        "pun": "He couldn't budget."
}, {
        "joke": "What did one toilet say to the other toilet?",
        "pun": "You look flushed."
}, {
        "joke": "Did you hear about the constipated Wheel of Fortune player?",
        "pun": "He wanted to buy a vowel."       
}, {
        "joke": "Did you know that diarrhea is hereditary?",
        "pun": "It runs in your genes."
}, {
        "joke": " I ate four cans of alphabet soup yesterday.", 
        "pun": "Then I had probably the biggest vowel movement ever."
}, {
        "joke": "Have you seen that new movie Constipated?",
        "pun": "It’s not come out yet."
}, {
        "joke": "Laughter is the best medicine.",
        "pun": "Unless you have diarrhea…"
}, {
        "joke": "What’s big and brown and behind the wall?",
        "pun": "Humpty’s Dump."
}, {
        "joke": "What did one fly say to the other?",
        "pun": "Is this stool taken?"
}, {
        "joke": "What do you get when you poop in your overalls?",
        "pun": "Dung-arees."
}, {
        "joke": "You never really appreciate what you’ve got until it’s gone.",
        "pun": "Toilet paper is a good example."
}, {
        "joke": "A man never really knows just how much he farts…",
        "pun": "Until he spends a day with a girl he really likes."
}, {
        "joke": "I was going to tell you a poop joke",
        "pun": "but it’s really crappy."
}, {
        "joke": "What do you call Clark Kent with diarrhea?",
        "pun": "Poop-erman."
}, {
        "joke": "Do you want to hear a poop joke?",
        "pun": "Never mind it’s too corny."
}, {
        "joke": "I woke myself up by farting last night.",
        "pun": "At least now the neighbors will never invite me round to see their holiday photos again."
}, {
        "joke": "An old married couple are in church one Sunday when the woman turns to her husband and says, I’ve just let out a really long, silent fart. What should I do?",
        "pun": "The husband turned to her and said, Replace the battery in your hearing aid."
}, {
        "joke": "I farted at work the other day and my workmate started trying to open the window.",
        "pun": "It must have been a really bad one – we work on a submarine."
}, {
        "joke": "How many men does it take to change a roll of toilet paper?",
        "pun": "I don’t know; it has never been done!"
}, {
        "joke": "What did little William Shakespeare ponder when he was potty training?",
        "pun": "To poop or not to poop...that is the question."
}, {
        "joke": "What do you get when the Queen farts?",
        "pun": "A noble gas."
}, {
        "joke": "Why did the toilet paper roll down the hill?",
        "pun": "To get to the bottom."
}, {
        "joke": "There are two reasons never to drink toilet water….",
        "pun": "Number one and number two!"
}, {
        "joke": "Did you hear about Robin Hood's toilet?",
        "pun": "He had a Little John!"
}, {
        "joke": "Melanie (age 5) asked her Granny how old she was. Granny replied she was so old she didn't remember any more. Melanie said,",
        "pun": "If you don't remember, just look in the back of your panties. Mine say five to six."
}, {
        "joke": "How many people does it take to smell up the bathroom?",
        "pun": "Just a phew."
}, {
        "joke": "When should you make vegetable soup in the toilet?",
        "pun": "When it has a leek in it."
}, {
        "joke": "What happens if you accidentally fall into the potty?",
        "pun": "You stink or swim."
}, {
        "joke": "Why do toilets run?",
        "pun": "They never learned how to jog."
}, {
        "joke": "Did you hear about the girl who fell off the potty?",
        "pun": "She was so embarrassed, her cheeks flushed."
}, {
        "joke": "Why did Tigger look in the toilet?",
        "pun": "He was looking for Pooh."
}, {
        "joke": "Why do farts stink?",
        "pun": "So deaf people can enjoy them too."
}, {
        "joke": "I rang the Incontinence Hotline yesterday ",
        "pun": "The woman said, Can you hold, please."
}, {
        "joke": "What’s the definition of a surprise?",
        "pun": "A fart with a lump in it."
}, {
        "joke": "Did you hear about the movie Constipation?",
        "pun": "It never came out."
}, {
        "joke": "What do you call a vegetarian with diarrhea?",
        "pun": "A salad shooter!"
}, {
        "joke": "How did Captain Hook hurt himself?",
        "pun": "He wiped with the wrong hand."
}, {
        "fact": "Poop should sink. Floating stools are often an indication of high fat content, which can be a sign of malabsorption."
}, {
        "fact": "The smell of books makes some people need to poop. The Mariko Aoki phenomenon is the urge to defecate while visiting a bookstore."
}, {
        "fact": "Wombats have cube shaped poop which they use to remember where they live."
}, {
        "fact": "Pandas can poop up to 48 pounds per day"
}, {
        "fact": "Some of the shooting stars we see are actually astronaut poop burning up in the atmosphere."
}, {
        "fact": "There are four bags of astronaut poop on the moon, left behind by Neil Armstrong on his Apollo mission."
}, {
        "fact": "Bird poop is white because birds can't pee. The paste is excreted through the bird's cloaca, a multi-purpose hole which means sewer in Latin."
}, {
        "fact": "The mega colon of the Balloon Man measured more than 7 feet long and 27 inches in circumference. Not surprisingly, severe constipation did him in."
}, {
        "fact": "The Parrot fish eats coral and poops sand, creating many of the small islands and beaches of the Caribbean. "
}, {
        "fact": "During WWII, German tank drivers thought it was good luck to drive over camel dung. The British found out and made explosives that looked like poop."
}, {
        "fact": "Some caterpillars can fling their feces up to 3 feet to elude predators."
}, {
        "fact": "Piles of manure can be dangerous; microorganisms generate heat as they decompose manure and can spontaneously combust if hot enough."
}, {
        "fact": "85% of bathroom related injuries occur when someone falls into the toilet after the seat has been left up!"
}, {
        "fact": "The average person visits the toilet 6-8 times each day or 2500 times per year. Therefore, in an average lifetime we spend 3 years on the toilet!"
}, {
        "fact": "One out of ten people have pictures of loved ones in their bathrooms. In other words, 10 percent of people have their family watch them go."
}, {
        "fact": "Men spend an average of 2.4 minutes longer on the toilet than women do."
}, {
        "fact": "Water makes up about 75 percent of your bowel movements. The rest is an often-stinky combination of fiber, dead and live bacteria, other cells, and mucus."
}, {
        "fact": "The perfect stool is log-like and S-shaped, not broken up into pieces."
}, {
        "fact": "The average American man excretes 150 grams (about one-third of a pound) of stool every day, or the equivalent of 5 tons in a lifetime!"
}, {
        "fact": "Digestion takes from 24 to 72 hours, as food travels down your esophagus to your stomach, then to your small and large intestine, and out the anus."
}, {
        "fact": "Diarrhea is the result of stool passing too quickly through the large intestine, where most of the water content is absorbed."
}, {
        "fact": "It’s normal to pass gas anywhere from 10 to 18 times a day"
}, {
        "fact": "Women are more likely to discuss bathroom experiences with their friends than men."
}, {
        "fact": "The phrase short end of the stick, dates back to the Roman era. It refers to grabbing the wrong end of the stick with a sponge attached, which was used to wipe."
}, {
        "fact": "Sloths only poop once a week and it’s called the poo dance."
}, {
        "fact": "In the early 20th century, horse poop caused so much pollution that automobiles were seen as the “green” alternative."
}, {
        "fact": "All the poop generated on the US Navy’s newest Gerald R. Ford-class aircraft carrier will be vaporized by plasma."
}, {
        "fact": "Dubai has no sewer system. Instead they use poop trucks to haul the entire city's excrement away."
}, {
        "fact": "3 billion people around the world still rely on charcoal and dung to cook their food…"
}, {
        "fact": "Salvador Dalí smeared himself with goat dung before meeting his wife for the first time"
}, {
        "fact": "In India, a company makes paper products out of elephant dung."
}, {
        "fact": "The outer skin of a corn kernel is indigestible and seem to appear as whole kernels in our stool."
}, {
        "fact": "Rabbits can poop up to 500 pellets per day."
}, {
        "fact": "The average human poops 2 pounds a day. Elephants produce up to 80 pounds per day!"
}, {
        "fact": "White stool can be caused by a lack of bile."
}, {
        "fact": "With the help of a high-fiber diet, the longest poop ever recorded was 26 feet."
}, {
        "fact": "Poop stinks because bacteria produce foul smelling compounds that are rich in sulfur and nitrogen"
 }, {
        "fact": "One third of human bowel movments are composed of dead bacteria."
}, {
        "fact": "Tió de Nadal is a mythical Christmas character made by decorating a short log. It is fed each day from December 8th until Christmas, at which time it is sung to and beaten with sticks until it poops out gifts"
}, {
        "fact": "Eliminating your poop is vital to good health. Pooping more than once per day is ideal."
}, {
        "fact": "Unless you’ve eaten a bunch of tomatoes or other red food, red poop is something you should get advice from a doctor about. It can indicate that there is blood in your poop caused from disease."
}, {
        "fact": "Poop that is light in color could indicate an issue with your bile and seeking medical evaluation is necessary."
}, {
        "fact": "Yellow poop, especially if foul-smelling indicates malabsorption of fats in your diet. If it persistent, seek medical advice."
}, {
        "fact": "Green poop can mean your food is moving through your large intestine too rapidly. It could also mean you have eaten a lot of green leafy vegetables. Keep an eye on it."
}, {
        "fact": "Black poop could mean you are bleeding internally. It could also be a result of vitamin supplements such as iron. Black poop should be addressed with your physician."
}, {
        "fact": "Poop is naturally brown because of the bile produced in the liver. Brown is the color poop is supposed to be and is normal."
}, {
        "fact": "The word POOP comes from the Middle English word POUPEN, meaning to blow a horn or toot. (i.e., to fart)"
}, {
        "fact": "Squatting over the toilet makes for a quicker, more effortless session than sitting."
}, {
        "fact": "If blue whales eat shrimps or prawns, their poo will be pink"
}, {
        "fact": "Green Bay Wisconsin produces the most toilet paper in the world"
}, {
        "fact": "The first toilet ever seen on TV in the USA was on Leave It To Beaver"
}, {
        "fact": "40,000 Americans are injured by toilets every year"        
}]

