[{
        "joke": "The 2nd fastest thing is poop, what is even faster?",
        "pun": "Water splashing back up."
}, {
        "joke": "Do you have a bathroom? No, it’s only for the employees.",
        "pun": "Well, I’d like to apply for a job."
}, {
        "joke": "One added negative, about being blind",
        "pun": "You never know when your done wiping."
}, {
        "joke": "If White Castle was a real castle…",
        "pun": "The moat would be made of diarrhea."
}, {
        "joke": "Have you heard of the constipated mathematician?",
        "pun": "He worked it out with a pencil."
}, {
        "joke": "What’s the true definition of bravery?",
        "pun": "Chancing a fart when you know you’ve had diarrhea."
}, {
        "joke": "Support Bacteria!",
        "pun": "They’re the only culture some people have."
}, {
        "joke": "What would you call a person who sends fart jokes by email all the time?",
        "pun": "A person who passed gas frequently."
}, {
        "joke": "What do you get if you eat beans and onions?",
        "pun": "Tear gas."
}, {
        "fact": "Poop should sink listen for the sound of your stool as it hits the water in the toilet. Floating stools are often an indication of high fat content, which can be a sign of malabsorption, a condition in which you can't absorb enough fat and other nutrients from the food you’re ingesting. It’s associated with celiac disease or chronic pancreatitis."
}, {
        "fact": "The smell of books makes some people need to poop. The Mariko Aoki phenomenon consists of the urge to defecate while visiting a bookstore. Originating in Japan, it is named after the woman who first publicized such an urge."
}, {
        "fact": "Wombats have cube shaped poop, which they use to remember where they live."
}, {
        "fact": "Pandas can poop up to 48 pounds per day"
}, {
        "fact": "Some of the shooting stars we see are actually astronaut poop burning up in the atmosphere."
}, {
        "fact": "There are four bags of astronaut poop on the moon, left behind by Neil Armstrong on his Apollo mission."
}, {
        "fact": "Bird poop is white because birds can't pee. Their kidneys work like ours do, but instead of producing urine, birds excrete a white paste. The paste, along with what comes out of the intestines, unites and is excreted through the bird's cloaca, a multi-purpose hole which means sewer in Latin. And, yes, by multi-purpose, I mean they even mate through it."
}, {
        "fact": "Cavemen were better equipped to chew and digest many plants and vegetables. They had larger molars and longer digestive tracts better at handling foods rich in indigestible cellulose, like, er, corn, for instance. Evolution has worked against our ability to chew and digest corn, which is why when some kernels get swallowed whole they appear in poop."
}, {
        "fact": "In the Mutter Museum in Philadelphia, Pennsylvania lay the mega colon of J.W., also know as the Balloon Man in a local freak show exhibit. J.W.'s colon measures more than seven feet in length and a staggering 27 inches in circumference. Not surprisingly, severe constipation did J.W. in at age 29. His bowels contained over 40 lbs of poop at the time of his death."
}, {
        "fact": "It has long been postured that Elvis Presley died from straining at the toilet. The King's official cause of death is listed as Arrhythmia, a condition that is not unassciated with bathroom fatalism. In fact, a 1991 study of patients at one Colorado hospital revealed that a quarter of the pulmonary embolism deaths were \"defecation associated.\" This theory certainly falls in-line with Graceland's luxurious bathroom containing a television, telephones, and many, many books."
}, {
        "fact": "The gastrointestinal tract's true elasticity is tested only by drug mules. Stuffing, the insertion of something (usually illegal) directly into the rectum is a short-term solution to prison contraband, or quick concealment. The retum is designed to be a storage container, but typically only holds 100ml of feces. Practice makes perfect, however. With practice the retum can be stretched to allow as much as 800 ml or nearly a kilo of cocaine, and that's on the low end of rectal-stetching activities. "
}, {
        "fact": "During WWII, German tank drivers thought it was good luck to drive over camel dung. The British found out and made explosives that looked like poop."
}, {
        "fact": "Some caterpillars can fling their feces up to 3 feet to elude predators."
}, {
        "fact": "Piles of manure can be dangerous; microorganisms generate heat as they decompose manure and can spontaneously combust if how enough. One such fire in 20055 was set by a 4 million pound pile of cow manure near Lincoln, Nebraska. It could not be extinguished using conventional means, as dousing it with water would lead to contaminated run-off. The fire smoldered on for months before it went out."
}, {
        "fact": "85% of bathroom related injuries occur when someone falls into the toilet after the seat has been left up!"
}, {
        "fact": "The average person visits the toilet 2500 times a year 6-8 times a day. Therefore, in an average lifetime we spend 3 years on the toilet!"
}, {
        "fact": "One out of ten people have pictures of loved ones in their bathrooms. In other words, 10 percent of people have their family watch them go."
}, {
        "fact": "Men spend an average of 2.4 minutes longer on the toilet than women do."
}, {
        "fact": "Women are more likely so discuss bathroom experiences with their friends than men."
}, {
        "fact": "The phrase short end of the stick, dates back to the Roman era. Referring to grabbing the wrong end of the stick used to wipe. Which was a sponge attached to a stick."
}]

